In [1]:
import pandas as pd

# Q1. List any five functions of the pandas library with execution.

### Functions
1. read_csv()
2. head()
3. tail()
4. drop()
5. groupby()

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [4]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.drop('PassengerId',axis=1)[1:3]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [6]:
df.groupby('Sex').sum()

/tmp/ipykernel_3363/3906318127.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Sex').sum()

        PassengerId  Survived  Pclass       Age  SibSp  Parch        Fare
Sex
female       135343       233     678   7286.00    218    204  13966.6628
male         262043       109    1379  13919.17    248    136  14727.2865

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
df = pd.DataFrame({'Col1':'Val1','Col2':'Val2','Col3':'Val3'},index=[['A','B','C']])
df

   Col1  Col2  Col3
A  Val1  Val2  Val3
B  Val1  Val2  Val3
C  Val1  Val2  Val3

In [8]:
df.index = [ i  for i in range(1,len(df)*2,2)]
df

   Col1  Col2  Col3
1  Val1  Val2  Val3
3  Val1  Val2  Val3
5  Val1  Val2  Val3

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [9]:
df = pd.DataFrame({'Values':  [10, 20, 30, 40, 50]})
df[0:3].apply(lambda x : x.sum())

Values    60
dtype: int64

<h1>Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.</h1>

In [10]:
def text_to_wordCount(mylist):
    wordlist = mylist.split()
    return len(wordlist)
    
    
df = pd.DataFrame({'text':'write a Python function to create a new column'},index=[0])
df['Word_Count'] = df['text'].apply(text_to_wordCount)
df

                                             text  Word_Count
0  write a Python function to create a new column           9

<h1>Q5. How are DataFrame.size() and DataFrame.shape() different?</h1>

>* **DataFrame.size()** returns the total number of elements in the DataFrame. This is equal to the number of rows multiplied by the number of columns.
>* **DataFrame.shape()** returns a tuple containing the number of rows and columns in the DataFrame.

In [11]:
df.size

2

In [12]:
df.shape

(1, 2)

<h1>Q6. Which function of pandas do we use to read an excel file?</hm1>

<code>pd.read_excel('test.xlsx')<code>

<h1>Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.</h1>
<p>
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.</p>

In [13]:
def email_to_username(myl):
    usr = myl.split('@')
    return usr[0]
 
         
df = pd.DataFrame({'Email':'username@domain.com'},index=[0])
df['UserName'] = df['Email'].apply(email_to_username)
df

                 Email  UserName
0  username@domain.com  username

<h1>Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:</h1>
<pre>
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
</pre>
<p>
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.
</p>

In [14]:
def NewDF(df):
    return df[(df['A'] >5) & (df['B'] <10)]
df = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})
newdf = NewDF(df)
newdf

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

<h1>Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.</h1>

In [15]:
def statistics(df):
    data  = {'Mean':df['Values'].mean(),
           	'Median':df['Values'].median(),
           	'StdDev': df['Values'].std()}
    return data['Mean'],data['Median'],data['StdDev']

df = pd.DataFrame({'Values':  [10, 20, 30, 40, 50]})
df['Mean'],df['Median'],df['StdDev'] = statistics(df)
df

   Values  Mean  Median     StdDev
0      10  30.0    30.0  15.811388
1      20  30.0    30.0  15.811388
2      30  30.0    30.0  15.811388
3      40  30.0    30.0  15.811388
4      50  30.0    30.0  15.811388


<h1>Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.</h1>

In [16]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df


df = pd.DataFrame({
    'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
    'Date': pd.date_range('2023-02-20', periods=10, freq='D')
})
df = calculate_moving_average(df)
print(df)

   Sales       Date  MovingAverage
0     10 2023-02-20           10.0
1     20 2023-02-21           15.0
2     30 2023-02-22           20.0
3     40 2023-02-23           25.0
4     50 2023-02-24           30.0
5     60 2023-02-25           35.0
6     70 2023-02-26           40.0
7     80 2023-02-27           50.0
8     90 2023-02-28           60.0
9    100 2023-03-01           70.0

<h1>Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.</h1>
<pre>
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.
</pre>

In [17]:
data = ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
df1 = pd.DataFrame({'date':data},index = [i for i in range(5)])

In [18]:
df1

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [19]:
df1['date'] = pd.to_datetime(df1['date'])
df1['WeekDay'] = df1['date'].dt.strftime('%A')
df1

        date    WeekDay
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

<h1>Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.</h1>

In [20]:
def myfunc(df):
    return df[(df['date'] >'2023-01-01') & (df['date'] < '2023-01-31') ]

dates = pd.date_range(start='2023-01-01',end='2023-02-11')
df = pd.DataFrame({'date':dates},)


df = myfunc(df)[1:29:5]
df

         date
2  2023-01-03
7  2023-01-08
12 2023-01-13
17 2023-01-18
22 2023-01-23
27 2023-01-28

<h1>Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?</h1>

In [21]:
import pandas as pd